---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.GenericDepth
source: html/f2246e26-1991-2595-f28c-af8639244bca.htm
---
# Autodesk.Revit.DB.ParameterTypeId.GenericDepth Property

"Depth"

## Syntax (C#)
```csharp
public static ForgeTypeId GenericDepth { get; }
```